app/controllers/automovels_controller.rb

  def index
    @automovels = Automovel.all
---
SELECT `automovels`.* FROM `automovels`

  def show
    @automovel = Automovel.find(params[:id])
---
SELECT `automovels`.* FROM `automovels` WHERE `automovels`.`id` = 1 LIMIT 1

  def edit
    @automovel = Automovel.find(params[:id])
---
SELECT `automovels`.* FROM `automovels` WHERE `automovels`.`id` = 1 LIMIT 1

  def create
    @automovel = Automovel.new(params[:automovel])

    respond_to do |format|
      if @automovel.save
---
INSERT INTO `automovels` (`born_on`, `created_at`, `nome`, `tipo`, `updated_at`) VALUES ('2013-02-22', '2013-02-15 11:44:57', 'Fusca', 1, '2013-02-15 11:44:57')

  def update
    @automovel = Automovel.find(params[:id])
---
SELECT `automovels`.* FROM `automovels` WHERE `automovels`.`id` = 1 LIMIT 1