app/controllers/washings_controller.rb

SELECT `washings`.* FROM `washings`
---
  def index
    @washings = Washing.all

SELECT `washings`.* FROM `washings` WHERE `washings`.`id` = 2 LIMIT 1
---
  def show
    @washing = Washing.find(params[:id])

INSERT INTO `washings` (`automovel_id`, `created_at`, `type_id`, `updated_at`) VALUES (NULL, '2013-02-15 12:57:16', 0, '2013-02-15 12:57:16')
---
  def create
    @washing = Washing.new(params[:washing])

    respond_to do |format|
      if @washing.save